jonahn/EE478/Lab2/PIC_SOURCES/h/p18f86j94.h
extern volatile far  unsigned char       LCDDATA4;
extern volatile far  struct {
  unsigned S32C0:1;
  unsigned S33C0:1;
  unsigned S34C0:1;
  unsigned S35C0:1;
  unsigned S36C0:1;
  unsigned S37C0:1;
  unsigned S38C0:1;
  unsigned S39C0:1;
} LCDDATA4bits;
extern volatile far  unsigned char       LCDDATA5;
extern volatile far  struct {
  unsigned S40C0:1;
  unsigned S41C0:1;
  unsigned S42C0:1;
  unsigned S43C0:1;
  unsigned S44C0:1;
  unsigned S45C0:1;
  unsigned S46C0:1;
  unsigned S47C0:1;
} LCDDATA5bits;
extern volatile far  unsigned char       LCDDATA6;
extern volatile far  struct {
  unsigned S48C0:1;
  unsigned S49C0:1;
  unsigned S50C0:1;
  unsigned S51C0:1;
  unsigned S52C0:1;
  unsigned S53C0:1;
  unsigned S54C0:1;
  unsigned S55C0:1;
} LCDDATA6bits;
extern volatile far  unsigned char       LCDDATA7;
extern volatile far  struct {
  unsigned S56C0:1;
  unsigned S57C0:1;
  unsigned S58C0:1;
  unsigned S59C0:1;
  unsigned S60C0:1;
  unsigned S61C0:1;
  unsigned S62C0:1;
  unsigned S63C0:1;
} LCDDATA7bits;
extern volatile far  unsigned char       LCDDATA8;
extern volatile far  struct {
  unsigned S00C1:1;
  unsigned S01C1:1;
  unsigned S02C1:1;
  unsigned S03C1:1;
  unsigned S04C1:1;
  unsigned S05C1:1;
  unsigned S06C1:1;
  unsigned S07C1:1;
} LCDDATA8bits;
extern volatile far  unsigned char       LCDDATA9;
extern volatile far  struct {
  unsigned S08C1:1;
  unsigned S09C1:1;
  unsigned S10C1:1;
  unsigned S11C1:1;
  unsigned S12C1:1;
  unsigned S13C1:1;
  unsigned S14C1:1;
  unsigned S15C1:1;
} LCDDATA9bits;
extern volatile far  unsigned char       LCDDATA10;
extern volatile far  struct {
  unsigned S16C1:1;
  unsigned S17C1:1;
  unsigned S18C1:1;
  unsigned S19C1:1;
  unsigned S20C1:1;
  unsigned S21C1:1;
  unsigned S22C1:1;
  unsigned S23C1:1;
} LCDDATA10bits;
extern volatile far  unsigned char       LCDDATA11;
extern volatile far  struct {
  unsigned S24C1:1;
  unsigned S25C1:1;
  unsigned S26C1:1;
  unsigned S27C1:1;
  unsigned S28C1:1;
  unsigned S29C1:1;
  unsigned S30C1:1;
  unsigned S31C1:1;
} LCDDATA11bits;
extern volatile far  unsigned char       LCDDATA12;
extern volatile far  struct {
  unsigned S32C1:1;
  unsigned S33C1:1;
  unsigned S34C1:1;
  unsigned S35C1:1;
  unsigned S36C1:1;
  unsigned S37C1:1;
  unsigned S38C1:1;
  unsigned S39C1:1;
} LCDDATA12bits;
extern volatile far  unsigned char       LCDDATA13;
extern volatile far  struct {
  unsigned S40C1:1;
  unsigned S41C1:1;
  unsigned S42C1:1;
  unsigned S43C1:1;
  unsigned S44C1:1;
  unsigned S45C1:1;
  unsigned S46C1:1;
  unsigned S47C1:1;
} LCDDATA13bits;
extern volatile far  unsigned char       LCDDATA14;
extern volatile far  struct {
  unsigned S48C1:1;
  unsigned S49C1:1;
  unsigned S50C1:1;
  unsigned S51C1:1;
  unsigned S52C1:1;
  unsigned S53C1:1;
  unsigned S54C1:1;
  unsigned S55C1:1;
} LCDDATA14bits;
extern volatile far  unsigned char       LCDDATA15;
extern volatile far  struct {
  unsigned S56C1:1;
  unsigned S57C1:1;
  unsigned S58C1:1;
  unsigned S59C1:1;
  unsigned S60C1:1;
  unsigned S61C1:1;
  unsigned S62C1:1;
  unsigned S63C1:1;
} LCDDATA15bits;
extern volatile far  unsigned char       LCDDATA16;
extern volatile far  struct {
  unsigned S00C2:1;
  unsigned S01C2:1;
  unsigned S02C2:1;
  unsigned S03C2:1;
  unsigned S04C2:1;
  unsigned S05C2:1;
  unsigned S06C2:1;
  unsigned S07C2:1;
} LCDDATA16bits;
extern volatile far  unsigned char       LCDDATA17;
extern volatile far  struct {
  unsigned S08C2:1;
  unsigned S09C2:1;
  unsigned S10C2:1;
  unsigned S11C2:1;
  unsigned S12C2:1;
  unsigned S13C2:1;
  unsigned S14C2:1;
  unsigned S15C2:1;
} LCDDATA17bits;
extern volatile far  unsigned char       LCDDATA18;
extern volatile far  struct {
  unsigned S16C2:1;
  unsigned S17C2:1;
  unsigned S18C2:1;
  unsigned S19C2:1;
  unsigned S20C2:1;
  unsigned S21C2:1;
  unsigned S22C2:1;
  unsigned S23C2:1;
} LCDDATA18bits;
extern volatile far  unsigned char       LCDDATA19;
extern volatile far  struct {
  unsigned S24C2:1;
  unsigned S25C2:1;
  unsigned S26C2:1;
  unsigned S27C2:1;
  unsigned S28C2:1;
  unsigned S29C2:1;
  unsigned S30C2:1;
  unsigned S31C2:1;
} LCDDATA19bits;
extern volatile far  unsigned char       LCDDATA20;
extern volatile far  struct {
  unsigned S32C2:1;
  unsigned S33C2:1;
  unsigned S34C2:1;
  unsigned S35C2:1;
  unsigned S36C2:1;
  unsigned S37C2:1;
  unsigned S38C2:1;
  unsigned S39C2:1;
} LCDDATA20bits;
extern volatile far  unsigned char       LCDDATA21;
extern volatile far  struct {
  unsigned S40C2:1;
  unsigned S41C2:1;
  unsigned S42C2:1;
  unsigned S43C2:1;
  unsigned S44C2:1;
  unsigned S45C2:1;
  unsigned S46C2:1;
  unsigned S47C2:1;
} LCDDATA21bits;
extern volatile far  unsigned char       LCDDATA22;
extern volatile far  struct {
  unsigned S48C2:1;
  unsigned S49C2:1;
  unsigned S50C2:1;
  unsigned S51C2:1;
  unsigned S52C2:1;
  unsigned S53C2:1;
  unsigned S54C2:1;
  unsigned S55C2:1;
} LCDDATA22bits;
extern volatile far  unsigned char       LCDDATA23;
extern volatile far  struct {
  unsigned S56C2:1;
  unsigned S57C2:1;
  unsigned S58C2:1;
  unsigned S59C2:1;
  unsigned S60C2:1;
  unsigned S61C2:1;
  unsigned S62C2:1;
  unsigned S63C2:1;
} LCDDATA23bits;
extern volatile far  unsigned char       LCDDATA24;
extern volatile far  struct {
  unsigned S00C3:1;
  unsigned S01C3:1;
  unsigned S02C3:1;
  unsigned S03C3:1;
  unsigned S04C3:1;
  unsigned S05C3:1;
  unsigned S06C3:1;
  unsigned S07C3:1;
} LCDDATA24bits;
extern volatile far  unsigned char       LCDDATA25;
extern volatile far  struct {
  unsigned S08C3:1;
  unsigned S09C3:1;
  unsigned S10C3:1;
  unsigned S11C3:1;
  unsigned S12C3:1;
  unsigned S13C3:1;
  unsigned S14C3:1;
  unsigned S15C3:1;
} LCDDATA25bits;
extern volatile far  unsigned char       LCDDATA26;
extern volatile far  struct {
  unsigned S16C3:1;
  unsigned S17C3:1;
  unsigned S18C3:1;
  unsigned S19C3:1;
  unsigned S20C3:1;
  unsigned S21C3:1;
  unsigned S22C3:1;
  unsigned S23C3:1;
} LCDDATA26bits;
extern volatile far  unsigned char       LCDDATA27;
extern volatile far  struct {
  unsigned S24C3:1;
  unsigned S25C3:1;
  unsigned S26C3:1;
  unsigned S27C3:1;
  unsigned S28C3:1;
  unsigned S29C3:1;
  unsigned S30C3:1;
  unsigned S31C3:1;
} LCDDATA27bits;
extern volatile far  unsigned char       LCDDATA28;
extern volatile far  struct {
  unsigned S32C3:1;
  unsigned S33C3:1;
  unsigned S34C3:1;
  unsigned S35C3:1;
  unsigned S36C3:1;
  unsigned S37C3:1;
  unsigned S38C3:1;
  unsigned S39C3:1;
} LCDDATA28bits;
extern volatile far  unsigned char       LCDDATA29;
extern volatile far  struct {
  unsigned S40C3:1;
  unsigned S41C3:1;
  unsigned S42C3:1;
  unsigned S43C3:1;
  unsigned S44C3:1;
  unsigned S45C3:1;
  unsigned S46C3:1;
  unsigned S47C3:1;
} LCDDATA29bits;
extern volatile far  unsigned char       LCDDATA30;
extern volatile far  struct {
  unsigned S48C3:1;
  unsigned S49C3:1;
  unsigned S50C3:1;
  unsigned S51C3:1;
  unsigned S52C3:1;
  unsigned S53C3:1;
  unsigned S54C3:1;
  unsigned S55C3:1;
} LCDDATA30bits;
